app/Http/Controllers/Site/SiteController.php

    public function index()
    {
        $plans = Plan::with('details')->orderBy('price', 'ASC')->get();
---
select * from `plans` order by `price` asc

    public function plan($url)
    {
        if(!$plan = Plan::where('url', $url)->first()) {
---
select * from `plans` where `url` = 'businers' limit 1